In [1]:
import pandas as pd

In [5]:
# import total production data for petroleum and alternative energy
total_energy_production = pd.read_csv("Total_Production.csv").reset_index()
total_energy_production.head(10)

,level_0,level_1,level_2,Report generated on: 02-08-2021 21:25:26
0,Series Key,INTL.4415-1-USA-QBTU.A,Series Key,INTL.4419-1-USA-QBTU.A
1,Series Name,Total energy production from petroleum and oth...,Series Name,"Total energy production from nuclear, renewabl..."
2,Units,QBTU,Units,QBTU
3,Frequency,A,Frequency,A
4,1980,20.474,1980,8.168
5,1981,20.412,1981,8.421
6,1982,20.458,1982,9.111
7,1983,20.528,1983,9.698
8,1984,21.082,1984,9.99
9,1985,21.196,1985,10.16

In [6]:
# drop the additional rows that do not contain data by year
total_energy_production.drop([0,1,2,3],inplace=True)
total_energy_production.head()

  level_0 level_1 level_2 Report generated on: 02-08-2021 21:25:26
4    1980  20.474    1980                                    8.168
5    1981  20.412    1981                                    8.421
6    1982  20.458    1982                                    9.111
7    1983  20.528    1983                                    9.698
8    1984  21.082    1984                                     9.99

In [7]:
# rename the columns to the correct names
total_energy_production.rename(columns={
    "level_0":"Year",
    "level_1":"Total petroleum energy production qBtu",
    "level_2":"Year2",
    "Report generated on: 02-08-2021 21:25:26":"Total alternative energy production qBtu"},inplace=True)
total_energy_production.head()

,Year,Total petroleum energy production qBtu,Year2,Total alternative energy production qBtu
4,1980,20.474,1980,8.168
5,1981,20.412,1981,8.421
6,1982,20.458,1982,9.111
7,1983,20.528,1983,9.698
8,1984,21.082,1984,9.99

In [22]:
# create separate dataframes
petroleum_production = total_energy_production.drop(columns=["Year2","Total alternative energy production qBtu"])
alternative_production = total_energy_production.drop(columns=["Year","Total petroleum energy production qBtu"]).rename(columns={"Year2":"Year"})

In [17]:
# check dtypes of columns to see if need to change
# petroleum_production.info()
# alternative_production.info()

In [27]:
# change dtypes for petroleum production dataframe
petroleum_production["Total petroleum energy production qBtu"] = petroleum_production["Total petroleum energy production qBtu"].astype("float")
petroleum_production["Year"] = petroleum_production["Year"].astype("int")
petroleum_production.head()

   Year  Total petroleum energy production qBtu
4  1980                                  20.474
5  1981                                  20.412
6  1982                                  20.458
7  1983                                  20.528
8  1984                                  21.082

In [28]:
# change dtypes for alternative production dataframe
alternative_production["Total alternative energy production qBtu"] = alternative_production["Total alternative energy production qBtu"].astype("float")
alternative_production["Year"] = alternative_production["Year"].astype("int")
alternative_production.head()

   Year  Total alternative energy production qBtu
4  1980                                     8.168
5  1981                                     8.421
6  1982                                     9.111
7  1983                                     9.698
8  1984                                     9.990